In [2]:
import pandas as pd

customers = pd.read_csv('/kaggle/input/datasets-day8/day8_customers.csv')
orders = pd.read_csv('/kaggle/input/datasets-day8/day8_orders.csv')

customers.head()

   customer_id   name       city  age
0            1  Aisha      Delhi   21
1            2  Rahul     Mumbai   23
2            3  Sneha      Delhi   22
3            4  Kabir  Bangalore   25
4            5  Meera     Mumbai   20

In [3]:
orders.head()

   order_id  customer_id  amount     category  order_date
0       101            1     500  Electronics  2024-01-05
1       102            2    1200  Electronics  2024-01-10
2       103            1     700      Fashion  2024-02-02
3       104            3     300      Fashion  2024-02-10
4       105            4    1500  Electronics  2024-03-01

In [4]:
import sqlite3

conn = sqlite3.connect(':memory:')
customers.to_sql('customers', conn, index=False, if_exists='replace')
orders.to_sql('orders', conn, index=False, if_exists='replace')

10

In [5]:
query = """
SELECT *
FROM customers;
"""

pd.read_sql(query, conn)

   customer_id    name       city  age
0            1   Aisha      Delhi   21
1            2   Rahul     Mumbai   23
2            3   Sneha      Delhi   22
3            4   Kabir  Bangalore   25
4            5   Meera     Mumbai   20
5            6  Ananya      Delhi   24
6            7   Rohan       Pune   26
7            8  Simran     Mumbai   22

**All customers from Delhi**

In [6]:
query = """
Select * from customers
where city = 'Delhi'
"""

pd.read_sql(query, conn)

   customer_id    name   city  age
0            1   Aisha  Delhi   21
1            3   Sneha  Delhi   22
2            6  Ananya  Delhi   24

**Customers older than 22**

In [7]:
query = """
SELECT * from customers
where age > 22
"""

pd.read_sql(query, conn)

   customer_id    name       city  age
0            2   Rahul     Mumbai   23
1            4   Kabir  Bangalore   25
2            6  Ananya      Delhi   24
3            7   Rohan       Pune   26

**All orders above 1000**

In [8]:
query = """
SELECT * from orders
where amount > 1000
"""

pd.read_sql(query, conn)

   order_id  customer_id  amount     category  order_date
0       102            2    1200  Electronics  2024-01-10
1       105            4    1500  Electronics  2024-03-01
2       109            7    2000  Electronics  2024-04-10
3       110            8    1100         Home  2024-04-12

**Top 3 highest order amounts**

In [11]:
query = """
SELECT * from orders
order by amount desc
limit 3 ;
"""

pd.read_sql(query, conn)

   order_id  customer_id  amount     category  order_date
0       109            7    2000  Electronics  2024-04-10
1       105            4    1500  Electronics  2024-03-01
2       102            2    1200  Electronics  2024-01-10

**Youngest two customers**

In [13]:
query = """
SELECT * from customers
order by age asc
limit 2
"""

pd.read_sql(query, conn)

   customer_id   name    city  age
0            5  Meera  Mumbai   20
1            1  Aisha   Delhi   21

**Customers whose name starts with 'A'**

In [14]:
query = """
SELECT * from customers
where name LIKE 'A%' ;
"""

pd.read_sql(query, conn)

   customer_id    name   city  age
0            1   Aisha  Delhi   21
1            6  Ananya  Delhi   24

**Customers from Delhi or Mumbai**

In [15]:
query = """
SELECT * from customers
WHERE city IN ('Delhi', 'Mumbai')
"""

pd.read_sql(query, conn)

   customer_id    name    city  age
0            1   Aisha   Delhi   21
1            2   Rahul  Mumbai   23
2            3   Sneha   Delhi   22
3            5   Meera  Mumbai   20
4            6  Ananya   Delhi   24
5            8  Simran  Mumbai   22

**Categories containing 'Elect'**

In [18]:
query = """
SELECT * from orders
WHERE category LIKE '%Elect%'
"""

pd.read_sql(query, conn)

   order_id  customer_id  amount     category  order_date
0       101            1     500  Electronics  2024-01-05
1       102            2    1200  Electronics  2024-01-10
2       105            4    1500  Electronics  2024-03-01
3       108            6     800  Electronics  2024-04-05
4       109            7    2000  Electronics  2024-04-10

**Total revenue**

In [21]:
query = """
SELECT SUM(amount)
from orders
"""

pd.read_sql(query, conn)

   SUM(amount)
0         9400

**Average order amount**

In [23]:
query = """
SELECT AVG(amount)
from orders
"""

pd.read_sql(query, conn)

   AVG(amount)
0        940.0

**Total number of orders**

In [24]:
query = """
SELECT COUNT(*)
from orders
"""

pd.read_sql(query, conn)

   COUNT(*)
0        10

**Revenue per customer**

**Revenue per category**

**Customers with total spending >1000**